app/helpers/application_helper.rb

  def manufacturers_to_select
    Product.distinct.pluck(:manufacturer).sort
---
SELECT DISTINCT "products"."manufacturer" FROM "products"

  def models_to_select
    Product.distinct.pluck(:model).sort
---
SELECT DISTINCT "products"."model" FROM "products"

  def carrier_plan_types_to_select
    Product.distinct.pluck(:carrier_plan_type).sort
---
SELECT DISTINCT "products"."carrier_plan_type" FROM "products"