app/controllers/product_uploads_controller.rb

  def create
    @product_upload = ProductUpload.new(product_upload_params)

    if @product_upload.save
---
INSERT INTO "product_uploads" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-11-01 18:19:05.622768"], ["updated_at", "2020-11-01 18:19:05.622768"]]