app/views/products/index.html.erb

            <p class="control is-expanded">
              <%= form.select :manufacturer, options_for_select(manufacturers_to_select),
                                  { prompt: 'Fabricante...' },
                                  { data: { action: 'change->product#handleManufacturerSelectChange',
                                            target: 'product.manufacturer' },
                                     class: 'input'} %>
---
SELECT "products".* FROM "products"

            <p class="control is-expanded">
              <%= form.select :carrier_plan_type, options_for_select(carrier_plan_types_to_select),
                                       { prompt: 'Plano...' }, { data: { target: 'product.carrierPlanType' }, class: 'input'} %>
---
SELECT "products".* FROM "products" WHERE "products"."carrier_plan_type" = $1 ORDER BY "products"."created_at" DESC  [["carrier_plan_type", "pos"]]